{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "complaint",
    "1": "general_question",
    "2": "logistics",
    "3": "payment",
    "4": "product_inquiry",
    "5": "refund",
    "6": "self_harm_or_suicide_risk",
    "7": "technical_support",
    "8": "unknown"
  },
  "initializer_range": 0.02,
  "label2id": {
    "complaint": 0,
    "general_question": 1,
    "logistics": 2,
    "payment": 3,
    "product_inquiry": 4,
    "refund": 5,
    "self_harm_or_suicide_risk": 6,
    "technical_support": 7,
    "unknown": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.10.1",
  "use_cache": false,
  "vocab_size": 30522
}
